Revit 2026 API

# MassSurfaceDataMaterialType Enumeration

---

Indicates how the visualization material for the MassSurfaceData is calculated.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MassSurfaceDataMaterialType
```
```vb
Public Enumeration MassSurfaceDataMaterialType
```
```cpp
public enum class MassSurfaceDataMaterialType
```
```fsharp
type MassSurfaceDataMaterialType
```

| Member name | Value | Description |
| --- | --- | --- |
| MaterialByConstruction | -2 | The visualization material for the MassSurfaceData will be taken from the material assigned to the ConceptualConstructionType which is assigned to the MassSurfaceData. |
| NormalMaterial | 0 | The visualization material for the MassSurfaceData will be taken from the material associated with the object style of the subcategory of the MassSurfaceData if the materialId is InvalidElementId, or the MassSurfaceData will use the specific material indicated by the materialId property if its value is an ElementId of a MaterialElement. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace